# Imorting pandas

In [1]:
import pandas as pd
import numpy as np

# Pandas Series

# Creating pandas series

In [2]:
my_series=pd.Series([1,2,3,4,"Cat"],index=["a","b","c","d","e"])
my_series

a      1
b      2
c      3
d      4
e    Cat
dtype: object

In [3]:
my_series=pd.Series({"a":1,"b":4,"c":6})
my_series

a    1
b    4
c    6
dtype: int64

# Accessing values inside pandas series

In [4]:
my_series=pd.Series([1,2,3,4,"Cat"],index=["a","b","c","d","e"])
my_series

a      1
b      2
c      3
d      4
e    Cat
dtype: object

In [5]:
my_series[1]

2

In [6]:
my_series["b"]

2

# Pandas Data Frames

# Creating pandas data frames

# (01) Using dictionaries

In [7]:
d={"Name":["Sam","Jane","Kane"],"Age":[23,24,25]}
df=pd.DataFrame(d)
df

   Name  Age
0   Sam   23
1  Jane   24
2  Kane   25

# (02) Using numpy arrays

In [8]:
arr=np.array([[12,23],[23,56],[43,21]])
df=pd.DataFrame(arr,columns=["Col1","Col2"])
df

   Col1  Col2
0    12    23
1    23    56
2    43    21

# (03) Using pandas series

In [9]:
my_series=pd.Series([1,2,3,4,7],index=["a","b","c","d","e"])
df=my_series.to_frame()
df

   0
a  1
b  2
c  3
d  4
e  7

In [10]:
df.columns=["Col1"]
df

   Col1
a     1
b     2
c     3
d     4
e     7

In [11]:
my_series1=pd.Series([1,2,3,4,7],index=["a","b","c","d","e"])
my_series2=pd.Series([6,5,7,8,2],index=["a","b","c","d","e"])
df=pd.concat([my_series1,my_series2],axis=1)
df.columns=["Col1","Col2"]
df

   Col1  Col2
a     1     6
b     2     5
c     3     7
d     4     8
e     7     2

# (04) Creating data frames using CSV files

In [12]:
df=pd.read_csv(r"C:\Users\user\jupyter notebook\Samadi my python\iris.csv")
df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

# Top values of the data set

In [13]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# Bottom values of the data set

In [14]:
df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

# Columns & indexes of the data set

In [15]:
df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [16]:
list(df.index)

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 101,
 102,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 118,
 119,
 120,
 121,
 122,
 123,
 124,
 125,
 126,
 127,
 128,
 129,
 130,
 131,
 132,
 133,
 134,
 135,
 136,
 137,
 138,
 139,
 140,
 141,
 142,
 143,
 144,
 145,
 146,
 147,
 148,
 149]

# Shape of the data frame

In [17]:
df.shape

(150, 5)

In [18]:
print(df.shape[0])
print(df.shape[1])

150
5

In [19]:
len(df)          # This gives the number of rows

150

# (05) Creating data frames using Excel files

In [20]:
ef=pd.ExcelFile(r"C:\Users\user\jupyter notebook\Samadi my python\iris.XLSX")
ef

In [21]:
ef.sheet_names             # Excel has sevaral sheet

['iris', 'marks']

In [22]:
df1=ef.parse("iris")
df1.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [23]:
df2=ef.parse("marks")
df2.head()

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

In [24]:
df=pd.read_excel(r"C:\Users\user\jupyter notebook\Samadi my python\iris.XLSX")
df.head()

# here you can import only 1st sheet in the excel file

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [25]:
# if you want to another file

df = pd.read_excel(r"C:\Users\user\jupyter notebook\Samadi my python\iris.XLSX", sheet_name = "marks")
df.head()

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

# Adding new columns

In [26]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [27]:
df["Col4"]=[23,33,46,57,76]
df

   Col1  Col2  Col3  Col4
0    12    45    56    23
1    22    43    43    33
2    23    44    46    46
3    34    46    67    57
4    45    54    65    76

# Accessing columns & elements

In [28]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

# Accessing columns

In [29]:
df.columns

Index(['Col1', 'Col2', 'Col3'], dtype='object')

In [30]:
df["Col1"]

0    12
1    22
2    23
3    34
4    45
Name: Col1, dtype: int64

In [31]:
df[["Col1","Col2"]]

   Col1  Col2
0    12    45
1    22    43
2    23    44
3    34    46
4    45    54

# Accessing elements

In [32]:
df.iloc[0,1]         # row * column

45

In [33]:
df.iat[0,2]          # same as "iloc"

56

In [34]:
df.iloc[:3,1]

0    45
1    43
2    44
Name: Col2, dtype: int64

In [35]:
df.loc[0,"Col1"]

12

In [36]:
df.loc[0,["Col1", "Col2"]]

Col1    12
Col2    45
Name: 0, dtype: int64

In [37]:
df.at[0,"Col2"]           # but "loc" get less time than "at"

45

# Converting to arrays

In [38]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [39]:
df["Col1"].values

array([12, 22, 23, 34, 45], dtype=int64)

In [40]:
df.values

array([[12, 45, 56],
       [22, 43, 43],
       [23, 44, 46],
       [34, 46, 67],
       [45, 54, 65]], dtype=int64)

# Basic column operations

In [41]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

   Col1  Col2
0     0     1
1     2     3
2     4     5
3     6     7
4     8     9

In [42]:
df["Col3"]=df["Col1"]+df["Col2"]
df

   Col1  Col2  Col3
0     0     1     1
1     2     3     5
2     4     5     9
3     6     7    13
4     8     9    17

In [43]:
df["Col4"]=["A" if v>=10 else "B" for v in df["Col3"]]
df

   Col1  Col2  Col3 Col4
0     0     1     1    B
1     2     3     5    B
2     4     5     9    B
3     6     7    13    A
4     8     9    17    A

# Pandas data frames with apply function

### "def" use for create function for single value
### "map" use for create function for List
### "apply" use for create function for DataFrame

In [44]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

   Col1  Col2
0     0     1
1     2     3
2     4     5
3     6     7
4     8     9

In [45]:
df.apply(sum, axis = 0)

Col1    20
Col2    25
dtype: int64

In [46]:
df.apply(sum, axis = 1)

0     1
1     5
2     9
3    13
4    17
dtype: int64

In [47]:
df.apply(np.median,axis=0)

Col1    4.0
Col2    5.0
dtype: float64

In [48]:
fun=lambda L:L[0]*L[len(L)-1]

In [49]:
# 01. single element

fun([12, 45, 6, 4, 89])

1068

In [50]:
# 02. list of element

list(map(fun, [[12, 45, 23], [44, 15, 19], [71, 10, 36]]))

[276, 836, 2556]

In [51]:
# 03. dataframe
df.apply(fun, axis = 1)

0     0
1     6
2    20
3    42
4    72
dtype: int64

In [52]:
df=pd.DataFrame({"English":[45,56,67,89,78],"Maths":[89,65,15,78,89]})
df

   English  Maths
0       45     89
1       56     65
2       67     15
3       89     78
4       78     89

In [53]:
df["grade1"] = df["English"].apply(lambda X: "A "if X>75 else "B" if X>50 else "F")
df["grade2"] = df["Maths"].apply(lambda X: "A "if X>75 else "B" if X>50 else "F")
df

   English  Maths grade1 grade2
0       45     89      F     A
1       56     65      B      B
2       67     15      B      F
3       89     78     A      A
4       78     89     A      A

In [54]:
df=pd.DataFrame({"English":[45,56,67,89,78],"Maths":[89,65,15,78,89]})
df

   English  Maths
0       45     89
1       56     65
2       67     15
3       89     78
4       78     89

In [55]:
result=lambda L:"Pass" if np.mean(L)>=50 else "Fail"

In [56]:
result = df.apply(result, axis = 1)
result

0    Pass
1    Pass
2    Fail
3    Pass
4    Pass
dtype: object

In [57]:
type(result)        # output in a series there for we want to convert it in to dataframe

pandas.core.series.Series

In [58]:
df["result"] = result
df

   English  Maths result
0       45     89   Pass
1       56     65   Pass
2       67     15   Fail
3       89     78   Pass
4       78     89   Pass

# Pandas data frames with lambda & map function

In [59]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

   Col1  Col2
0     0     1
1     2     3
2     4     5
3     6     7
4     8     9

In [60]:
fun=lambda x:2*x

In [61]:
df["Col3"] = df["Col2"].map(fun)
df

   Col1  Col2  Col3
0     0     1     2
1     2     3     6
2     4     5    10
3     6     7    14
4     8     9    18

In [62]:
df = pd.DataFrame({"English" : [45, 78, 26, 48, 59, 48, 23, 66, 78, 25], "Maths" : [12, 15, 78, 99, 36, 56, 45, 36, 89, 75]})

df["Garde_Eng"] = df["English"].map(lambda x: "A" if x>=75 else "B" if x>=65 else "C" if x>=50 else "F")
df["Garde_Math"] = df["Maths"].map(lambda x: "A" if x>=75 else "B" if x>=65 else "C" if x>=50 else "F")

df["Result"] = df[["English", "Maths"]].apply(lambda x: "Pass" if np.mean(x)>=50 else "Fail", axis = 1)

df

   English  Maths Garde_Eng Garde_Math Result
0       45     12         F          F   Fail
1       78     15         A          F   Fail
2       26     78         F          A   Pass
3       48     99         F          A   Pass
4       59     36         C          F   Fail
5       48     56         F          C   Pass
6       23     45         F          F   Fail
7       66     36         B          F   Pass
8       78     89         A          A   Pass
9       25     75         F          A   Pass

# Selecting rows that have certain values

# Boolean masking technique

In [63]:
df=pd.DataFrame({"Name":["A","B","C","D","E","F"],"Age":[23,33,21,35,23,34],"Result":["Pass","Fail","Pass","Pass","Fail","Fail"]})
df

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
3    D   35   Pass
4    E   23   Fail
5    F   34   Fail

In [64]:
df["Result"]=="Pass"

0     True
1    False
2     True
3     True
4    False
5    False
Name: Result, dtype: bool

In [65]:
df[df["Result"]=="Pass"]          # Select the guys who have passed

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass

In [66]:
df[df["Age"]>=30]          # Guys who are older than 30

  Name  Age Result
1    B   33   Fail
3    D   35   Pass
5    F   34   Fail

In [67]:
df[(df["Age"]<30 )&(df["Result"]=="Pass")]        # Guys who are younfer than 30 and passed the exam

  Name  Age Result
0    A   23   Pass
2    C   21   Pass

# Selecting with lambda with map function

In [68]:
fun=lambda L: "Pass" in L
df["Result"].map(fun)

0     True
1    False
2     True
3     True
4    False
5    False
Name: Result, dtype: bool

In [69]:
df[df["Result"].map(fun)]

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass

In [70]:
df[df["Age"].map(lambda a : a>30)]

  Name  Age Result
1    B   33   Fail
3    D   35   Pass
5    F   34   Fail

# Data summaries

In [71]:
data=np.random.random(10).reshape(5,2)
data

array([[0.90008231, 0.71442268],
       [0.88314497, 0.82486881],
       [0.09388766, 0.77460729],
       [0.68303994, 0.80451425],
       [0.04299632, 0.0506028 ]])

In [72]:
df=pd.DataFrame(data,columns=["A","B"],index=["a","b","c","d","e"])
df

          A         B
a  0.900082  0.714423
b  0.883145  0.824869
c  0.093888  0.774607
d  0.683040  0.804514
e  0.042996  0.050603

# Summaries for each column

In [73]:
df.describe()

              A         B
count  5.000000  5.000000
mean   0.520630  0.633803
std    0.421907  0.328670
min    0.042996  0.050603
25%    0.093888  0.714423
50%    0.683040  0.774607
75%    0.883145  0.804514
max    0.900082  0.824869

# Summaries for each row

#### python havn't method for get summaries for row views, Therefore we mest convert(transform) row to column

In [74]:
df.transpose().describe()

              a         b         c         d         e
count  2.000000  2.000000  2.000000  2.000000  2.000000
mean   0.807252  0.854007  0.434247  0.743777  0.046800
std    0.131281  0.041207  0.481341  0.085895  0.005379
min    0.714423  0.824869  0.093888  0.683040  0.042996
25%    0.760838  0.839438  0.264068  0.713409  0.044898
50%    0.807252  0.854007  0.434247  0.743777  0.046800
75%    0.853667  0.868576  0.604427  0.774146  0.048701
max    0.900082  0.883145  0.774607  0.804514  0.050603

# Categorical columns

In [75]:
df=pd.DataFrame({"A":[23,34,21,45,67],"B":[45,24,67,88,67],"C":["a","a","b","b","a"]})
df

    A   B  C
0  23  45  a
1  34  24  a
2  21  67  b
3  45  88  b
4  67  67  a

In [76]:
df.describe()

               A          B
count   5.000000   5.000000
mean   38.000000  58.200000
std    18.841444  24.427444
min    21.000000  24.000000
25%    23.000000  45.000000
50%    34.000000  67.000000
75%    45.000000  67.000000
max    67.000000  88.000000

In [77]:
df.describe(include="all")

                A          B    C
count    5.000000   5.000000    5
unique        NaN        NaN    2
top           NaN        NaN    a
freq          NaN        NaN    3
mean    38.000000  58.200000  NaN
std     18.841444  24.427444  NaN
min     21.000000  24.000000  NaN
25%     23.000000  45.000000  NaN
50%     34.000000  67.000000  NaN
75%     45.000000  67.000000  NaN
max     67.000000  88.000000  NaN

# Finding sums for columns and rows separately

In [78]:
df = pd.DataFrame(np.random.random(10).reshape(5, 2))
df

          0         1
0  0.691053  0.957929
1  0.939364  0.328636
2  0.632617  0.823208
3  0.753103  0.920482
4  0.033461  0.915096

In [79]:
df.sum()

0    3.049599
1    3.945352
dtype: float64

In [80]:
df.sum(axis=1)

0    1.648982
1    1.268001
2    1.455825
3    1.673586
4    0.948558
dtype: float64

# Finding cumulative sums for columns and rows separately

In [81]:
df.cumsum()

          0         1
0  0.691053  0.957929
1  1.630418  1.286565
2  2.263034  2.109773
3  3.016138  3.030256
4  3.049599  3.945352

In [82]:
df.cumsum(axis=1)

          0         1
0  0.691053  1.648982
1  0.939364  1.268001
2  0.632617  1.455825
3  0.753103  1.673586
4  0.033461  0.948558

# Finding means for columns and rows separately

In [83]:
df.mean()

0    0.60992
1    0.78907
dtype: float64

In [84]:
df.mean(axis=1)

0    0.824491
1    0.634000
2    0.727912
3    0.836793
4    0.474279
dtype: float64

# Finding minumum and maximum for columns and rows separately

In [85]:
df.min()

0    0.033461
1    0.328636
dtype: float64

In [86]:
df.min(axis=1)

0    0.691053
1    0.328636
2    0.632617
3    0.753103
4    0.033461
dtype: float64

In [87]:
df.max()

0    0.939364
1    0.957929
dtype: float64

In [88]:
df.max(axis=1)

0    0.957929
1    0.939364
2    0.823208
3    0.920482
4    0.915096
dtype: float64

# Dropping rows & columns

In [89]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

# Dropping rows

In [90]:
df1=df.drop("a")
df1

  Name  Age Result
b    B   33   Fail
c    C   21   Pass

In [91]:
df        # Oroginal data frame is not affected

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [92]:
df.drop("a",inplace=True)       # Oroginal data frame is affected
df

  Name  Age Result
b    B   33   Fail
c    C   21   Pass

In [93]:
# also you can this way

df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])

df.iloc[1:, :]

  Name  Age Result
b    B   33   Fail
c    C   21   Pass

# Dropping columns

In [94]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [95]:
df1=df.drop("Result",axis=1)
df1

  Name  Age
a    A   23
b    B   33
c    C   21

In [96]:
df2=df.drop(["Age","Result"],axis=1)
df2

  Name
a    A
b    B
c    C

In [97]:
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [98]:
df.drop(["Age","Result"],axis=1, inplace = True)
df

  Name
a    A
b    B
c    C

# Sorting data frames with column values

In [99]:
d={"Name":["Sam","Jane","Kane"],"Mark1":[67,54,44],"Mark2":[56,56,67],"Mark3":[78,89,76]}
df=pd.DataFrame(d)
df

   Name  Mark1  Mark2  Mark3
0   Sam     67     56     78
1  Jane     54     56     89
2  Kane     44     67     76

In [100]:
df.sort_values(by="Mark1")      # Sort the data frame with mark1 in ascending order

   Name  Mark1  Mark2  Mark3
2  Kane     44     67     76
1  Jane     54     56     89
0   Sam     67     56     78

In [101]:
df.sort_values(by="Mark1",ascending=False)       # Sort the data frame with mark1 in descending order

   Name  Mark1  Mark2  Mark3
0   Sam     67     56     78
1  Jane     54     56     89
2  Kane     44     67     76

In [102]:
df.sort_values(by="Name")          # Alphabetically

   Name  Mark1  Mark2  Mark3
1  Jane     54     56     89
2  Kane     44     67     76
0   Sam     67     56     78

# Grouping data frames with categorical data

In [103]:
d={"ID":[1001,1002,1003,1004,1005],
   "Age":[23,33,34,24,25],
   "Gender":["F","F","M","F","M"],
   "Marks":[67,69,76,74,90]}

df=pd.DataFrame(d)
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [104]:
g=df.groupby("Gender") #It is returning an object

In [105]:
list(g)

[('F',
       ID  Age Gender  Marks
  0  1001   23      F     67
  1  1002   33      F     69
  3  1004   24      F     74),
 ('M',
       ID  Age Gender  Marks
  2  1003   34      M     76
  4  1005   25      M     90)]

In [106]:
list(g)[0]

('F',
      ID  Age Gender  Marks
 0  1001   23      F     67
 1  1002   33      F     69
 3  1004   24      F     74)

In [107]:
for i,j in g:
    print(i)
    print(j)

F
     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
3  1004   24      F     74
M
     ID  Age Gender  Marks
2  1003   34      M     76
4  1005   25      M     90

# Summaries for other variables with grouping

In [108]:
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [109]:
df.drop("ID",inplace=True,axis=1)
df

   Age Gender  Marks
0   23      F     67
1   33      F     69
2   34      M     76
3   24      F     74
4   25      M     90

In [110]:
df.groupby("Gender").mean()

              Age  Marks
Gender
F       26.666667   70.0
M       29.500000   83.0

In [111]:
df.groupby("Gender").sum()

        Age  Marks
Gender
F        80    210
M        59    166

In [112]:
df.groupby("Gender")["Marks"].mean()

Gender
F    70
M    83
Name: Marks, dtype: int64

# Summarizing other variables with grouping by using multiple options

In [113]:
df.groupby("Gender").agg(["mean","median","max","min"])

              Age                Marks
             mean median max min  mean median max min
Gender
F       26.666667   24.0  33  23    70     69  74  67
M       29.500000   29.5  34  25    83     83  90  76

# Grouping with more than one columns

In [114]:
d={"Age":[23,33,34,24,25],
   "Gender":["F","F","M","F","M"],
   "Marks":[67,69,76,74,90],
   "University":["UOC","UOC","UOC","UOP","UOP"]}

df=pd.DataFrame(d)
df

   Age Gender  Marks University
0   23      F     67        UOC
1   33      F     69        UOC
2   34      M     76        UOC
3   24      F     74        UOP
4   25      M     90        UOP

In [115]:
df.groupby(["University","Gender"]).mean()

                   Age  Marks
University Gender
UOC        F        28     68
           M        34     76
UOP        F        24     74
           M        25     90

# Concatenating data frames

In [116]:
df1=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df2=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df3=pd.DataFrame(np.random.random((5,2)),columns=["C","D"])

# Concatenating along the rows

In [117]:
newdf=pd.concat([df1,df2])
newdf

          A         B
0  0.979217  0.462602
1  0.732791  0.042826
2  0.717748  0.452463
3  0.424081  0.764065
4  0.281386  0.492760
0  0.949827  0.924115
1  0.265860  0.926908
2  0.569308  0.644485
3  0.716911  0.320389
4  0.288203  0.847364

In [118]:
newdf=pd.concat([df1,df2],ignore_index=True)         #ignore_index will reset the index in the correct way
newdf

          A         B
0  0.979217  0.462602
1  0.732791  0.042826
2  0.717748  0.452463
3  0.424081  0.764065
4  0.281386  0.492760
5  0.949827  0.924115
6  0.265860  0.926908
7  0.569308  0.644485
8  0.716911  0.320389
9  0.288203  0.847364

# Concatenating along the columns

In [119]:
newdf=pd.concat([df1,df3],axis=1)
newdf

          A         B         C         D
0  0.979217  0.462602  0.954161  0.411883
1  0.732791  0.042826  0.260957  0.500312
2  0.717748  0.452463  0.062292  0.029632
3  0.424081  0.764065  0.150560  0.969593
4  0.281386  0.492760  0.030781  0.622416

# Merging data frames

In [120]:
df1=pd.DataFrame({"ID":[1,2,3,4],"Val1":[23,33,34,45]})
df2=pd.DataFrame({"ID":[3,4,5,6],"Val2":[56,32,67,65]})

In [121]:
df1

   ID  Val1
0   1    23
1   2    33
2   3    34
3   4    45

In [122]:
df2

   ID  Val2
0   3    56
1   4    32
2   5    67
3   6    65

**In here we can column join, but some ID's are same in both table, someware df1 ID-3 and df2 ID-3 are same, Therefore we cannot concant, Then we merge each data fremes**

# Focus on the common Ids

In [123]:
df3=pd.merge(df1,df2,on="ID",how="inner")
df3

   ID  Val1  Val2
0   3    34    56
1   4    45    32

# Focus on the all Ids

In [124]:
df4=pd.merge(df1,df2,on="ID",how="outer")
df4

   ID  Val1  Val2
0   1  23.0   NaN
1   2  33.0   NaN
2   3  34.0  56.0
3   4  45.0  32.0
4   5   NaN  67.0
5   6   NaN  65.0

# Focus on the left side data frame Ids

In [125]:
df5=pd.merge(df1,df2,on="ID",how="left")
df5

   ID  Val1  Val2
0   1    23   NaN
1   2    33   NaN
2   3    34  56.0
3   4    45  32.0

# Focus on the right side data frame Ids

In [126]:
df6=pd.merge(df1,df2,on="ID",how="right")
df6

   ID  Val1  Val2
0   3  34.0    56
1   4  45.0    32
2   5   NaN    67
3   6   NaN    65

# Using an indicator for showing how the tables are merged

In [127]:
df7=pd.merge(df1,df2,on="ID",how="outer",indicator=True)
df7

   ID  Val1  Val2      _merge
0   1  23.0   NaN   left_only
1   2  33.0   NaN   left_only
2   3  34.0  56.0        both
3   4  45.0  32.0        both
4   5   NaN  67.0  right_only
5   6   NaN  65.0  right_only

# Merging based on more than one column

In [128]:
df1=pd.DataFrame({"ID1":[1,2,3,4],"ID2":[7,8,9,10],"Val1":[23,33,34,45]})
df2=pd.DataFrame({"ID1":[2,3,5,6],"ID2":[8,9,10,11],"Val2":[56,32,67,65]})

In [129]:
df1

   ID1  ID2  Val1
0    1    7    23
1    2    8    33
2    3    9    34
3    4   10    45

In [130]:
df2

   ID1  ID2  Val2
0    2    8    56
1    3    9    32
2    5   10    67
3    6   11    65

In [131]:
newdf1=pd.merge(df1,df2,on=["ID1","ID2"],how="outer",indicator=True)
newdf1

   ID1  ID2  Val1  Val2      _merge
0    1    7  23.0   NaN   left_only
1    2    8  33.0  56.0        both
2    3    9  34.0  32.0        both
3    4   10  45.0   NaN   left_only
4    5   10   NaN  67.0  right_only
5    6   11   NaN  65.0  right_only

In [132]:
newdf2=pd.merge(df1,df2,on=["ID1","ID2"],how="inner")
newdf2

   ID1  ID2  Val1  Val2
0    2    8    33    56
1    3    9    34    32

# Counting values

In [139]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

  Col1 Col2 Col3
0    P    X    A
1    P    Y    B
2    Q    Z    C

In [142]:
pd.value_counts(df["Col1"])

P    2
Q    1
Name: Col1, dtype: int64

In [144]:
df["Col1"].value_counts()         # same

P    2
Q    1
Name: Col1, dtype: int64

In [143]:
df.apply(pd.value_counts)         # count all catagory in each column

   Col1  Col2  Col3
A   NaN   NaN   1.0
B   NaN   NaN   1.0
C   NaN   NaN   1.0
P   2.0   NaN   NaN
Q   1.0   NaN   NaN
X   NaN   1.0   NaN
Y   NaN   1.0   NaN
Z   NaN   1.0   NaN

# Unique values in a column

In [145]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

  Col1 Col2 Col3
0    P    X    A
1    P    Y    B
2    Q    Z    C

In [146]:
df["Col1"].unique()

array(['P', 'Q'], dtype=object)

# Pandas data frame is mutable(can change elements)
# Replace values in data frame

In [147]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":[3,6,8]}
df=pd.DataFrame(d)
df

  Col1 Col2  Col3
0    P    X     3
1    P    Y     6
2    Q    Z     8

In [148]:
df["Col1"].replace("P","A",inplace=True)
df

  Col1 Col2  Col3
0    A    X     3
1    A    Y     6
2    Q    Z     8

In [149]:
df["Col2"].replace(["X","Y"],["K","L"],inplace=True)
df

  Col1 Col2  Col3
0    A    K     3
1    A    L     6
2    Q    Z     8

In [154]:
# By accessing the values directly, they can be changed.
df.iat[0,2]=10
df

  Col1 Col2  Col3
0    A    K    10
1    A    L     6
2    Q    Z     8

In [155]:
df.iloc[0,2]=20
df

  Col1 Col2  Col3
0    A    K    20
1    A    L     6
2    Q    Z     8

In [156]:
df.iloc[0:2, 0] = ["R", "S"]
df

  Col1 Col2  Col3
0    R    K    20
1    S    L     6
2    Q    Z     8

# Stacking & Unstacking data frames

In [157]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":[3,6,8]}
df=pd.DataFrame(d)
df

  Col1 Col2  Col3
0    P    X     3
1    P    Y     6
2    Q    Z     8

In [158]:
df2=df.stack()
df2

0  Col1    P
   Col2    X
   Col3    3
1  Col1    P
   Col2    Y
   Col3    6
2  Col1    Q
   Col2    Z
   Col3    8
dtype: object

In [160]:
df2[1]

Col1    P
Col2    Y
Col3    6
dtype: object

In [159]:
df3=df2.unstack()
df3

  Col1 Col2 Col3
0    P    X    3
1    P    Y    6
2    Q    Z    8

# Creating Pivot tables

In [174]:
d={"Cat":["A","B","B","A","C","A","C","B"],"Rank":["1","2","1","2","1","2","1","2"],"Val":[4,5,6,8,3,9,8,2]}
df=pd.DataFrame(d)
df

  Cat Rank  Val
0   A    1    4
1   B    2    5
2   B    1    6
3   A    2    8
4   C    1    3
5   A    2    9
6   C    1    8
7   B    2    2

In [175]:
pivot2=df.pivot_table(index=["Cat","Rank"],aggfunc="mean")          # This is one way of creating a pivot table
pivot2

          Val
Cat Rank
A   1     4.0
    2     8.5
B   1     6.0
    2     3.5
C   1     5.5

In [176]:
df.pivot_table(index = ["Cat", "Rank"], aggfunc = ["mean", "median", "var", "std"])

         mean median   var       std
          Val    Val   Val       Val
Cat Rank
A   1     4.0    4.0   NaN       NaN
    2     8.5    8.5   0.5  0.707107
B   1     6.0    6.0   NaN       NaN
    2     3.5    3.5   4.5  2.121320
C   1     5.5    5.5  12.5  3.535534

# Binning

In [179]:
d={"ID":[1001,1002,1003,1004,1005],"Marks":[78,88,45,67,59]}
df=pd.DataFrame(d)
df

     ID  Marks
0  1001     78
1  1002     88
2  1003     45
3  1004     67
4  1005     59

In [180]:
df["Grade"]=["A" if m>=80 else "B" if m>=65 else "C" if m>=50 else "F" for m in df["Marks"]]
df

     ID  Marks Grade
0  1001     78     B
1  1002     88     A
2  1003     45     F
3  1004     67     B
4  1005     59     C

In [181]:
df["Grade2"]=df["Marks"].apply(lambda m: "A" if m>=80 else "B" if m>=65 else "C" if m>=50 else "F")
df

     ID  Marks Grade Grade2
0  1001     78     B      B
1  1002     88     A      A
2  1003     45     F      F
3  1004     67     B      B
4  1005     59     C      C

In [182]:
df["Grade2"] = df["Marks"].map(lambda a : "A" if a>80 else "B" if a>65 else "C" if a>50 else "F")
df

     ID  Marks Grade Grade2
0  1001     78     B      B
1  1002     88     A      A
2  1003     45     F      F
3  1004     67     B      B
4  1005     59     C      C

**Using binning**

In [183]:
d={"ID":[1001,1002,1003,1004,1005],"Marks":[78,88,45,67,59]}
df=pd.DataFrame(d)
df

     ID  Marks
0  1001     78
1  1002     88
2  1003     45
3  1004     67
4  1005     59

In [184]:
bins=[0,50,65,80,100]
grades=["F","C","B","A"]
df["Grade"]=pd.cut(df["Marks"],bins,labels=grades)
df

     ID  Marks Grade
0  1001     78     B
1  1002     88     A
2  1003     45     F
3  1004     67     B
4  1005     59     C

# Working with indexes & columns

In [186]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

# Columns of the data frame

In [187]:
df.columns

Index(['Name', 'Marks', 'Class'], dtype='object')

# Indexes of the data frame

In [188]:
df.index

Index(['a', 'b', 'c'], dtype='object')

# Changing the order of the rows

In [189]:
df2=df.reindex(["b","c","a"])
df2

   Name  Marks  Class
b   Pam     32      2
c  Jane     78      3
a   Sam     56      1

# Changing the order of the columns

In [190]:
df3=df.reindex(columns=["Marks","Name","Class"])
df3

   Marks  Name  Class
a     56   Sam      1
b     32   Pam      2
c     78  Jane      3

# Renaming the indexes & columns

In [191]:
df4=df.rename(index={"a":"p"},columns={"Class":"Class No"})
df4

   Name  Marks  Class No
p   Sam     56         1
b   Pam     32         2
c  Jane     78         3

In [192]:
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

In [194]:
df.columns=["Student Name","Subject Marks","Class Number"]
df.index=["x","y","z"]
df

  Student Name  Subject Marks  Class Number
x          Sam             56             1
y          Pam             32             2
z         Jane             78             3

# Making indexes as a column

In [195]:
df5=df.reset_index()
df5

  index Student Name  Subject Marks  Class Number
0     x          Sam             56             1
1     y          Pam             32             2
2     z         Jane             78             3

# Permutation & taking samples

In [197]:
d={"A":np.arange(1,11),"B":np.random.random(10),"C":np.random.randn(10)}
df=pd.DataFrame(d)
df

    A         B         C
0   1  0.069562 -0.013145
1   2  0.511690 -0.395826
2   3  0.994433  0.650890
3   4  0.492885 -1.894135
4   5  0.501866  0.827735
5   6  0.794811  1.353966
6   7  0.949307 -0.355674
7   8  0.459548  0.438149
8   9  0.508373 -0.760885
9  10  0.061369 -0.300529

# Method 01 - Taking a shuffled data frame

# Shuffling data

In [201]:
a=np.random.permutation(5)         # all posible option with in the 1 to 5 in randomly
a

array([0, 2, 4, 3, 1])

In [202]:
a=np.random.permutation(len(df))
a

array([0, 8, 2, 7, 3, 9, 5, 4, 1, 6])

In [203]:
df1=df.take(a)
df1

    A         B         C
0   1  0.069562 -0.013145
8   9  0.508373 -0.760885
2   3  0.994433  0.650890
7   8  0.459548  0.438149
3   4  0.492885 -1.894135
9  10  0.061369 -0.300529
5   6  0.794811  1.353966
4   5  0.501866  0.827735
1   2  0.511690 -0.395826
6   7  0.949307 -0.355674

# Random sample

In [206]:
import random

s=random.sample(list(np.arange(df.shape[0])),5)
s

[3, 9, 6, 0, 1]

In [207]:
df2=df.take(s)
df2

    A         B         C
3   4  0.492885 -1.894135
9  10  0.061369 -0.300529
6   7  0.949307 -0.355674
0   1  0.069562 -0.013145
1   2  0.511690 -0.395826

# Method 02 - Shuffling existing indexes

In [208]:
index_new=np.random.permutation(df.index)
index_new

array([3, 5, 8, 7, 6, 0, 4, 1, 9, 2], dtype=int64)

In [209]:
df3=df.reindex(index_new)
df3

    A         B         C
3   4  0.492885 -1.894135
5   6  0.794811  1.353966
8   9  0.508373 -0.760885
7   8  0.459548  0.438149
6   7  0.949307 -0.355674
0   1  0.069562 -0.013145
4   5  0.501866  0.827735
1   2  0.511690 -0.395826
9  10  0.061369 -0.300529
2   3  0.994433  0.650890

# Method 03 - Sample method

# Random sample

In [210]:
df_sample=df.sample(5)            # using this you can get 5 columns randomly
df_sample

    A         B         C
5   6  0.794811  1.353966
1   2  0.511690 -0.395826
0   1  0.069562 -0.013145
3   4  0.492885 -1.894135
9  10  0.061369 -0.300529

# Shuffling data frame

In [211]:
df_sample=df.sample(len(df))
df_sample

    A         B         C
5   6  0.794811  1.353966
4   5  0.501866  0.827735
1   2  0.511690 -0.395826
0   1  0.069562 -0.013145
3   4  0.492885 -1.894135
2   3  0.994433  0.650890
8   9  0.508373 -0.760885
9  10  0.061369 -0.300529
6   7  0.949307 -0.355674
7   8  0.459548  0.438149

In [212]:
df.sample(15, replace = True)

    A         B         C
8   9  0.508373 -0.760885
3   4  0.492885 -1.894135
6   7  0.949307 -0.355674
7   8  0.459548  0.438149
6   7  0.949307 -0.355674
2   3  0.994433  0.650890
9  10  0.061369 -0.300529
2   3  0.994433  0.650890
1   2  0.511690 -0.395826
3   4  0.492885 -1.894135
9  10  0.061369 -0.300529
2   3  0.994433  0.650890
6   7  0.949307 -0.355674
0   1  0.069562 -0.013145
5   6  0.794811  1.353966

# Directly dealing with pandas series.

In [23]:
df=pd.DataFrame({"Maths":[90,60],"Science":[78,83]},index=["Male","Female"])
df

        Maths  Science
Male       90       78
Female     60       83

In [4]:
df_perc=df.div(df.sum(axis=1),axis=0)*100
df_perc

            Maths    Science
Male    53.571429  46.428571
Female  41.958042  58.041958

In [6]:
df.add(100)

        Maths  Science
Male      190      178
Female    160      183

In [7]:
df["Maths"].add(100)

Male      190
Female    160
Name: Maths, dtype: int64

In [11]:
df.add([10, 12],axis=1)         # adding 10 for maths marks and sub by 12 Science marks

        Maths  Science
Male      100       90
Female     70       95

In [24]:
df

        Maths  Science
Male       90       78
Female     60       83

In [25]:
df.sum()

Maths      150
Science    161
dtype: int64

In [26]:
df.sum(axis=1)

Male      168
Female    143
dtype: int64

In [27]:
df["Total"] = df.sum(axis=1)
df

        Maths  Science  Total
Male       90       78    168
Female     60       83    143